[
  {
    "_id": "62ffc79c9ccd1429294451234",
    "title": "5 отличных мини-ПК начала осени 2022 года: от офисной системы до домашнего NAS-сервера",
    "description": "Ну что сказать — производители всего за месяц выпустили несколько отличных миниатюрных ПК, которые «заточены» под самые разные задачи. Здесь у нас и высокопроизводительные системы, и устройства для выполнения офисных задач, плюс специфические девайсы. Все эти гаджеты объединяет одно — они очень небольшие по размеру, что означает экономию пространства рабочего стола. Ну и если эта идея вас по душе, то прошу под кат. Возможно, вам на глаза недавно попался мини-ПК, которого нет в подборке? Давайте тогда обсудим это устройство в комментариях.\n\nMINISFORUM EliteMini B550 Это компактный десктопный ПК, который поддерживает процессоры линеек AMD Ryzen 4000 или 5000. Систему бы ничего особо не отличало от десятков себе подобных, если бы не порт под карту памяти и разъемы для подключения блока питания.\n\nВ системе могут быть установлены процессоры AMD Ryzen 7 4700G или Ryzen 7 5700G, в этом случае стоимость устройства начинается от $499. Но если нет желания переплачивать, можно выбрать систему вовсе без процессора. Это на случай, если у вас есть собственный. В этом случае стоимость устройства составляет $399 — внутри нет процессора, ОЗУ, диска, и, соответственно, не установлена операционная система.\n\nПри необходимости можно заказать продвинутую систему, которая, кроме озвученных выше чипов, будет включать 64 ГБ ОЗУ и 512 ГБ SSD. Единственное — несмотря на наличие коннектора под видеокарту, ее придется покупать самостоятельно. У ПК есть поддержка PCI 3.0 x16, так что подключить карту можно без проблем. Что касается размеров устройства, то это 167 x 158 x 67 мм. Внутри есть разъем для установки жесткого диска и SSD. Кроме того, есть два слота для установки оперативной памяти.\n\nСписок портов и разъемов:\n\n2 x HDMI\n1 x DisplayPort\n1 x USB 3.2 Gen 2 Type-C\n4 x USB 3.2 Gen 2 Type-A\n1 x 3.5mm микрофон\n1 x 3.5mm аудиовыход\n1 x 2.5 Gbps Ethernet\n1 x 19V DC\n\nВ целом, отличная система, которая, определенно, стоит своих денег.",
    "url": "https://habr.com/ru/company/selectel/blog/687290/",
    "source": "habr.com",
    "image": "https://habrastorage.org/r/w1560/webt/3y/-o/tk/3y-otkh4iogt2ht0lbaurcbgwp0.jpeg",
    "category": "general",
    "createdAt": "1660984847900",
    "updatedAt": "1660984847900",
    "__v": 0
  },
  {
    "_id": "62ffc79c9ccd142929445156",
    "title": "Midjourney — нейросеть генерирующая картинки по текстовому описанию",
    "description": "В наше время нейросетью уже мало кого удивишь, эти штуки умеют обрабатывать видео, вести диалог с человеком, выполнять поиск материалов в интернете, писать музыку, распознавать объекты на фото, помогают обрабатывать фото и многое другое. Сегодня я хочу рассказать о сетке рисующей картинки — Midjourney.\n\nКоманда Midjourney позиционирует себя как независимую исследовательскую лабораторию, занимающуюся расширением творческих способностей человечества.\n\nПроект был запущен в феврале 2022 ученым и предпринимателем Дэвидом Хольцом.\n\nДавид Хольц — выпускник факультета прикладной математики Университета Северной Каролины в Чапел-Хилл. В студенчестве работал в Институте Макса Планка, где изучал алгоритмы нейровизуализации, также работал в исследовательском центре NASA и принимал участие в разработке технологии LiDAR (обнаружение и определение дальности с помощью света, технология используется, в том числе, в камерах iPhone).\n\nПодробнее о личности основателя можно прочесть вот в этой заметке.\n\nMidjourney является независимым самофинансируемым проектом над которым трудится команда из 11 штатных сотрудников, а также большое количество внешних консультантов. Перечень всех участников проекта доступен на официальном сайте проекта.\n\nРаботу Midjourney обеспечивают алгоритмы распознавания речи и алгоритмы создающие образы. Проще говоря, Миджорни умеет распознавать печатный текст и преобразовывать его в картинки. Для этого необходимо на английском языке описать сюжет, направить его на обработку сетке и дождаться результата. После полученный результат можно немного модернизировать, увеличить его качество и скачать.",
    "url": "https://habr.com/ru/post/687524/",
    "source": "habr.com",
    "image": "https://habrastorage.org/r/w1560/getpro/habr/upload_files/ec2/956/c09/ec2956c09ea3da2ee2207ba1dec813fe.png",
    "category": "general",
    "createdAt": "1660984847920",
    "updatedAt": "1660984847920"
  },
  {
    "_id": "62ffc79c9ccd142929445573",
    "title": "ML.NET: можно ли доверять машинному обучению Microsoft?",
    "description": "В 2018 году Microsoft разработали ML.NET – фреймворк машинного обучения для .NET разработчиков. За прошедшее время эта библиотека претерпела существенные изменения и обзавелась новыми функциями для выявления закономерностей в данных. Посмотрим, как это отразилось на качестве её исходного кода. Перед началом разбора ошибок предлагаю познакомиться с самим фреймворком. ML.NET — разработанная компанией Microsoft бесплатная Open Source библиотека со средствами машинного обучения для языков программирования C# и F#. Она позволяет создавать функционал для получения автоматических прогнозов на основе закономерностей в данных, доступных вашему приложению.\n\nС помощью ML.NET можно обучить модель машинного обучения, указав соответствующий алгоритм, или импортировать предварительно обученные модели TensorFlow и ONNX.\n\nОбученную модель можно добавить в приложение и использовать её для получения прогнозов.\n\nНа момент написания этой статьи ML.NET включает в себя средства для решения следующих задач: классификация/категоризация, регрессия данных, обнаружение аномалий в данных, реализация рекомендательных систем, классификация изображений, анализ последовательностей и временных рядов.\n\nПознакомившись с проектом, можно перейти к основной теме – разбору найденных ошибок. Но сначала хочу отдать должное разработчикам Microsoft — проект выполнен весьма качественно, найти что-то страшное и интересное (в рамках тематики этой статьи) было непросто. Тем не менее есть несколько серьёзных моментов, заслуживающих внимания.",
    "url": "https://habr.com/ru/company/pvs-studio/blog/687358/",
    "source": "habr.com",
    "image": "https://habrastorage.org/r/w1560/getpro/habr/upload_files/7d4/69c/fab/7d469cfab435146aae5e0fcb8bfca787.png",
    "category": "sports",
    "createdAt": "1660984847940",
    "updatedAt": "1660984847940"
  }
]
